def read_black_list(user_vk_id):
    '''На вход ID пользователя, возвращает список из ID забаненных
    использовать для фильтрации при выводе новых партнеров'''
    ...
    return


def read_favorite_partners(user_vk_id):
    '''На вход ID пользователя, возвращает список из ID избранных
    использовать для фильтрации при выводе новых партнеров'''
    ...


def read_favorite_partners_all(user_vk_id):
    '''На вход ID пользователя, возвращает список избранных. В каком виде нужно продумать.'''
    ...


